CFD_UC/UC_2/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions [0 2 -2 0 0 0 0];
internalField uniform 0;
boundaryField
{
 ".*"
    {
        type            zeroGradient;
    }

  WB_inlet
  {
    type zeroGradient;
  }

 WB_outlet
  {
        type            fixedValue;
        value           $internalField;
  }

 

  WB_waterbox
  {
    type zeroGradient;
  }

  "procBoundary.*"
  {
    type processor;
    value uniform 0;
  }
    #include "include/frontBackUpperPatches"

}

